duxinglang-1/nRF9160_test/E2_V3_TEST/src/screen/screen.c
		SyncShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_SYNC].para&SCREEN_EVENT_UPDATE_SYNC)
			scr_msg[SCREEN_ID_SYNC].para &= (~SCREEN_EVENT_UPDATE_SYNC);

		SyncUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_SYNC].act = SCREEN_ACTION_NO;
}
#endif/*CONFIG_SYNC_SUPPORT*/

#ifdef CONFIG_TEMP_SUPPORT
static uint8_t img_flag = 0;
static uint8_t temp_retry_left = 2;

static void TempStatusTimerOutCallBack(struct k_timer *timer_id)
{
	if(screen_id == SCREEN_ID_TEMP)
	{
		switch(g_temp_status)
		{
		case TEMP_STATUS_PREPARE:
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TEMP;
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			break;
			
		case TEMP_STATUS_MEASURING:
			if(get_temp_ok_flag)
			{
				g_temp_status = TEMP_STATUS_MEASURE_OK;
			}
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TEMP;
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			break;
			
		case TEMP_STATUS_MEASURE_FAIL:
			if(temp_retry_left > 0)
			{
				g_temp_status = TEMP_STATUS_NOTIFY;
				scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TEMP;
				scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			}
			else
			{
				g_temp_status = TEMP_STATUS_MAX;
				EntryIdleScr();
			}
			break;

		case TEMP_STATUS_MEASURE_OK:
			g_temp_status = TEMP_STATUS_MAX;
			EntryIdleScr();
			break;

		case TEMP_STATUS_NOTIFY:
			g_temp_status = TEMP_STATUS_PREPARE;
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TEMP;
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			break;
		}
	}
}

void TempUpdateStatus(void)
{
	uint16_t x,y,w,h;
	uint8_t tmpbuf[64] = {0};
	uint8_t strbuf[64] = {0};
	uint32_t img_c[3] = {IMG_TEMP_BIG_ICON_C_1_ADDR,IMG_TEMP_BIG_ICON_C_2_ADDR,IMG_TEMP_BIG_ICON_C_3_ADDR};
	uint32_t img_f[3] = {IMG_TEMP_BIG_ICON_F_1_ADDR,IMG_TEMP_BIG_ICON_F_2_ADDR,IMG_TEMP_BIG_ICON_F_3_ADDR};

	switch(g_temp_status)
	{
	case TEMP_STATUS_PREPARE:
		LCD_Fill(TEMP_NOTIFY_X, TEMP_NOTIFY_Y, TEMP_NOTIFY_W, TEMP_NOTIFY_H, BLACK);
		
	#ifdef FONTMAKER_UNICODE_FONT
		LCD_SetFontSize(FONT_SIZE_28);
	#else
		LCD_SetFontSize(FONT_SIZE_24);
	#endif
		mmi_asc_to_ucs2(tmpbuf, "Body Temperature");
		LCD_MeasureUniString(tmpbuf,&w,&h);
		x = TEMP_NOTIFY_X+(TEMP_NOTIFY_W-w)/2;
		y = TEMP_NOTIFY_Y;
		LCD_ShowUniString(x, y, tmpbuf);
		
		MenuStartTemp();
		g_temp_status = TEMP_STATUS_MEASURING;
		break;
		
	case TEMP_STATUS_MEASURING:
		img_flag++;
		if(img_flag >= 3)
			img_flag = 0;

		if(global_settings.temp_unit == TEMP_UINT_C)
			LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, img_c[img_flag]);
		else
			LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, img_f[img_flag]);

	#ifdef FONTMAKER_UNICODE_FONT
		LCD_SetFontSize(FONT_SIZE_36);
	#else
		LCD_SetFontSize(FONT_SIZE_32);
	#endif

		if(get_temp_ok_flag)
		{
			LCD_Fill(TEMP_NOTIFY_X, TEMP_NOTIFY_Y, TEMP_NOTIFY_W, TEMP_NOTIFY_H, BLACK);
			if(global_settings.temp_unit == TEMP_UINT_C)
				LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_C_3_ADDR);
			else
				LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_F_3_ADDR);
			
			if(global_settings.temp_unit == TEMP_UINT_C)
				sprintf(tmpbuf, "%0.1f", g_temp_body);
			else
				sprintf(tmpbuf, "%0.1f", g_temp_body*1.8+32);
			mmi_asc_to_ucs2(strbuf, tmpbuf);
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			x = TEMP_NUM_X+(TEMP_NUM_W-w)/2;
			y = TEMP_NUM_Y+(TEMP_NUM_H-h)/2;
			LCD_ShowUniString(x, y, strbuf);
			
			if(global_settings.temp_unit == TEMP_UINT_C)
				LCD_ShowImg_From_Flash(x+w+5, TEMP_UNIT_Y, IMG_TEMP_UNIT_C_ADDR);
			else
				LCD_ShowImg_From_Flash(x+w+5, TEMP_UNIT_Y, IMG_TEMP_UNIT_F_ADDR);

			MenuStopTemp();
			SyncSendHealthData();
			g_temp_menu = 0;
			
			k_timer_start(&temp_status_timer, K_SECONDS(5), K_NO_WAIT);
		}
		break;
		
	case TEMP_STATUS_MEASURE_OK:
		if(global_settings.temp_unit == TEMP_UINT_C)
			LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_C_3_ADDR);
		else
			LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_F_3_ADDR);
		
		k_timer_start(&temp_status_timer, K_SECONDS(2), K_NO_WAIT);
		break;
		
	case TEMP_STATUS_MEASURE_FAIL:
		MenuStopTemp();

		LCD_Fill(TEMP_NOTIFY_X, TEMP_NOTIFY_Y, TEMP_NOTIFY_W, TEMP_NOTIFY_H, BLACK);
		if(global_settings.temp_unit == TEMP_UINT_C)
			LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_C_3_ADDR);
		else
			LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_F_3_ADDR);
		
	#ifdef FONTMAKER_UNICODE_FONT
		LCD_SetFontSize(FONT_SIZE_28);
	#else	
		LCD_SetFontSize(FONT_SIZE_24);
	#endif

		mmi_asc_to_ucs2(tmpbuf, "Inconclusive");
		LCD_MeasureUniString(tmpbuf,&w,&h);
		x = TEMP_NOTIFY_X+(TEMP_NOTIFY_W-w)/2;
		y = TEMP_NOTIFY_Y;
		LCD_ShowUniString(x, y, tmpbuf);

		temp_retry_left--;
		if(temp_retry_left == 0)
		{
			y += (h+2);
			mmi_asc_to_ucs2(tmpbuf, "Retry later");
			LCD_MeasureUniString(tmpbuf,&w,&h);
			x = HR_NOTIFY_X+(HR_NOTIFY_W-w)/2;
			LCD_ShowUniString(x, y, tmpbuf);
		}
		k_timer_start(&temp_status_timer, K_SECONDS(2), K_NO_WAIT);
		break;
		
	case TEMP_STATUS_NOTIFY:
		if(global_settings.temp_unit == TEMP_UINT_C)
			LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_C_3_ADDR);
		else
			LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_F_3_ADDR);

	#ifdef FONTMAKER_UNICODE_FONT
		LCD_SetFontSize(FONT_SIZE_28);
	#else	
		LCD_SetFontSize(FONT_SIZE_24);
	#endif

		mmi_asc_to_ucs2(tmpbuf, "Keep still and retry");
		LCD_MeasureUniString(tmpbuf,&w,&h);
		x = TEMP_NOTIFY_X+(TEMP_NOTIFY_W-w)/2;
		y = TEMP_NOTIFY_Y;
		LCD_ShowUniString(x, y, tmpbuf);

		k_timer_start(&temp_status_timer, K_SECONDS(5), K_NO_WAIT);
		break;
	}
}

void TempShowStatus(void)
{
	uint16_t x,y,w,h;
	uint8_t i,tmpbuf[64] = {0};
	float temp_max = 0.0, temp_min = 0.0;
	uint16_t temp[24] = {0};
	uint16_t color = 0x05DF;

	if(global_settings.temp_unit == TEMP_UINT_C)
		LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_C_3_ADDR);
	else
		LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_F_3_ADDR);

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_36);
#else	
	LCD_SetFontSize(FONT_SIZE_32);
#endif

	mmi_asc_to_ucs2(tmpbuf, "Stay still");
	LCD_MeasureUniString(tmpbuf,&w,&h);
	x = TEMP_NOTIFY_X+(TEMP_NOTIFY_W-w)/2;
	y = TEMP_NOTIFY_Y;
	LCD_ShowUniString(x, y, tmpbuf);

